In [8]:
import pandas as pd
disc={
    "name":["Aam","Jam","kam"],
    "age": [18,19,20],
    "city":["Pune","BPL","IND"],
}

In [9]:
disc

{'name': ['Aam', 'Jam', 'kam'],
 'age': [18, 19, 20],
 'city': ['Pune', 'BPL', 'IND']}

In [14]:
df=pd.DataFrame(disc, index=['x','y','z'])
df_i=pd.DataFrame(disc)

In [11]:
df

  name  age  city
x  Aam   18  Pune
y  Jam   19   BPL
z  kam   20   IND

In [16]:
df_i

  name  age  city
0  Aam   18  Pune
1  Jam   19   BPL
2  kam   20   IND

# Loc

Lable based data selection

In [12]:
df.loc["y"]

name    Jam
age      19
city    BPL
Name: y, dtype: object

In [13]:
df.loc["y","age"]

19

In [19]:
df.loc[:,"age"]

x    18
y    19
z    20
Name: age, dtype: int64

# iLoc

works on integer based indexing

In [20]:
df_i.iloc[:,:]

  name  age  city
0  Aam   18  Pune
1  Jam   19   BPL
2  kam   20   IND

In [21]:
df_i.iloc[0]

name     Aam
age       18
city    Pune
Name: 0, dtype: object

In [23]:
df_i.iloc[2,2]

'IND'

In [25]:
df_i.iloc[0,0]

'Aam'

In [27]:
df_i.iloc[1,1]

19

In [29]:
df_i.iloc[0,2]="NPG"

In [30]:
df_i

  name  age city
0  Aam   18  NPG
1  Jam   19  BPL
2  kam   20  IND

In [36]:
df1=pd.DataFrame({'A':[1,2,3,4,5],'B':[11,12,14,15,16]})
df2=pd.DataFrame({'A':[1,2,3,4,6],'C':[20,21,22,23,24]})

In [32]:
df1

   A   B
0  1  11
1  2  12
2  3  14
3  4  15
4  5  16

In [33]:
df2

   A   B
0  1  20
1  2  21
2  3  22
3  4  23
4  6  24

In [37]:
df_m=pd.merge(df1,df2)

In [48]:
df_m=pd.merge(df1,df2,how="full")
df_m

KeyError: 'full'